Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/cap07-omegat.tmx
Source language: ca
Languages: es_es

source: Quan es vol usar un sistema de traducció automàtica per a l'assimilació d'informació, a què donaríeu menys pes en l'avaluació?
es_es: ¿Cuando se quiere usar un sistema de traducción automática para la asimilación de información, a quú daríais menos peso en la evaluación?

source: [Solució 1 ($n$ mots):] El traductor professional tradueix un text de $n$ mots per 0,05$ n$ euros. El sistema de traducció automàtica el tradueix per 0,03$ n$ i corregir-lo costa 0,10$($10$/$100$) n$, és a dir, 0,01$ n$ euros perquè només 10 de cada 100 mots són incorrectes. Per tant, el sistema semiautomàtic costa només $($0,03$+$0,01$) n = $0,04$ n$ euros, davant dels 0,05$ n$ euros del traductor professional.
es_es: [Solución 1 ($n$ palabras):] El traductor profesional traduce un texto de $n$ palabras por 0,05$ n$ euros. El sistema de traducción automática lo traduce por 0,03$ n$ y corregirlo cuesta 0,10$($10$/$100$) n$, es decir, 0,01$ n$ euros porque sólo 10 de cada 100 palabras son incorrectas. Por lo tanto, el sistema semiautomático cuesta sólo $($0,03$+$0,01$) n = $0,04$ n$ euros, ante los 0,05$ n$ euros del traductor profesional.

source: És possible que ja us hàgeu adonat que el tok pisin té molt vocabulari pres de l'anglés, com a llengua de contacte que és.
es_es: Es posible que ya os hayáis dado cuenta que el tok pisin tiene mucho vocabulario tomado del inglés, como lengua de contacto que es.

source: Alguns dels avantatges de l'ús de llenguatges controlats {schwitten07u} es poden resumir com segueix: els textos són més senzills i intel·ligibles; el manteniment dels documents es facilita; se simplifica el tractament computacional dels documents, en particular la traducció automàtica. Quant als desavantatges, podem dir que: el disseny d'un llenguatge controlat no és gens trivial: cal estudiar amb profunditat corpus de textos pertanyents al domini i prendre decisions difícils; el poder d'expressió d'un llenguatge controlat és sempre més restringit; l'escriptura de textos en llenguatge controlat és més lenta; és necessària una inversió addicional de temps en l'aprenentatge del llenguatge controlat per part dels autors. Els dos últims desavantatges es poden reduir si es dota els autors d'eines informàtiques, com ara d'un editor de textos intel·ligent que els ajude a escriure en el llenguatge controlat.
es_es: Algunas de las ventajas del uso de lenguajes controlados {schwitten07uno} se pueden resumir como sigue: los textos son más sencillos e inteligibles; el mantenimiento de los documentos se facilita; se simplifica el tratamiento computacional de los documentos, en particular la traducción automática. En cuanto a las desventajas, podemos decir que: el diseño de un lenguaje controlado no es nada trivial: hay que estudiar con profundidad corpus de textos pertenecientes al dominio y tomar decisiones difíciles; el poder de expresión de un lenguaje controlado es siempre más restringido; la escritura de textos en lenguaje controlado es más lenta; es necesaria una inversión adicional de tiempo en el aprendizaje del lenguaje controlado por parte de los autores. Las dos últimas desventajas se pueden reducir si se dota a los autores de herramientas informáticas, como por ejemplo de un editor de textos inteligente que los ayude a escribir en el lenguaje controlado.

source: (a) (a) (b) (a) (a). Les preguntes es poden plantejar com en el problema . (b) (a)
es_es: (a) (a) (b) (a) (a). Las preguntas se pueden plantear como en el problema . (b) (a)

source: En molts àmbits la traducció automàtica està encara molt lluny de poder competir en qualitat amb la realitzada per traductors professionals (vegeu el capítol ). Per exemple, en molts casos és difícil aconseguir que l'ordinador sàpia elegir la interpretació correcta entre les possibles interpretacions d'un enunciat ambigu com Els soldats van disparar als xiquets. Els vaig veure caure. ja que això requereix l'ús de quantitats enormes de coneixement enciclopèdic sobre el funcionament del ``món real''. En aquest cas, el sistema ha de saber: que els trets fereixen greument o maten les persones que els reben i que la condició de ferit greu o mort és incompatible amb mantenir-se dret, i que, per tot això, la interpretació més probable és que van caure els xiquets, no els soldats. Com a conseqüència de problemes com aquest i d'altres de naturalesa diversa, en moltes aplicacions, la traducció produïda per un bon programa s'ha de considerar com un esborrany que ha de ser revisat.
es_es: En muchos ámbitos la traducción automática está todavía muy lejos de poder competir en calidad con la realizada por traductores profesionales (veáis el capítulo ). Por ejemplo, en muchos casos es difícil conseguir que el ordenador sepa elegir la interpretación correcta entre las posibles interpretaciones de un enunciado ambiguo como Los soldados dispararon a los niños. Los vi caer. puesto que esto requiere el uso de cantidades enormes de conocimiento enciclopédico sobre el funcionamiento del ``mundo real''. En este caso, el sistema tiene que saber: que los disparos hieren gravemente o matan a las personas que los reciben y que la condición de herido grave o muerto es incompatible con mantenerse derecho, y que, por todo esto, la interpretación más probable es que cayeron los niños, no los soldados. Como consecuencia de problemas como este y otros de naturaleza diversa, en muchas aplicaciones, la traducción producida por un buen programa se tiene que considerar como un borrador que tiene que ser revisado.

source: Solucions
es_es: Soluciones

source: El ``control'' dels llenguatges controlats{}
es_es: El ``control'' de los lenguajes controlados{}

source: Assimilació; més concretament per a allò que es diu screening. Disseminació. Postedició, ja que l'idioma del document canvia per què puga ser entés.
es_es: Asimilación; más concretamente para aquello que se llama screening. Diseminación. Postedición, puesto que el idioma del documento cambia para qué pueda ser entendido.

source: En els sistemes de traducció automàtica, la preedició... ... redueix la quantitat de postedició. ... és una alternativa a la postedició, que elimina completament aquesta última fase. ... imposibilita l'ús del sistema per a tasques de disseminació d'informació.
es_es: En los sistemas de traducción automática, la preedición... ... reduce la cantidad de postedición. ... es una alternativa a la postedición, que elimina completamente esta última fase. ... imposibilita el uso del sistema para tareas de diseminación de información.

source: Indica en quina d'aquestes situacions de traducció automàtica és menys crucial la perfecció lingüística de la traducció. Joan usa el Web Translator mentre navega per les pàgines d'Internet de la Universität Mainz per a saber quina assignatura dóna el professor Karl-Hans Lehninger i quins són els seus interessos investigadors. Joan usa el Web Translator per a fer una versió en alemany de la seua pàgina Web. El personal d'IBM tradueix patents europees per a detectar possibles avanços en correcció d'errors de comunicacions digitals.
es_es: Indica en cuál de estas situaciones de traducción automática es menos crucial la perfección lingüística de la traducción. Joan usa el Web Translator mientras navega por las páginas de Internet de la Universität Mainz para saber qué asignatura da el profesor Karl-Hans Lehninger y cuáles son sus intereses investigadores. Joan usa el Web Translator para hacer una versión en alemán de su página Web. El personal de IBM traduce patentes europeas para detectar posibles avances en corrección de errores de comunicaciones digitales.

source: (*) Per exemple, si $L$ és l'espanyol, mots com { escondite} poden referir-se a un lloc on amagar-se (1) o a un joc (2) (en $L'$=català, amagatall (1) i fet, { amagar}, fet a amagar o conillets a amagar (2)). En el llenguatge controlat, es podria evitar el primer significat proposant els autors que feren servir el mot alternatiu { escondrijo}. Les regles es podrien formular com segueix en espanyol:
es_es: () Por ejemplo, si $L$ es el español, palabras como { escondite} pueden referirse a un lugar donde esconderse (1) o a un juego (2) (en $El $=catalán, escondrijo (1) y hecho , { esconder}, hecho a esconder o conillets a esconder (2)). En el lenguaje controlado, se podría evitar el primer significado proponiendo los autores que usaron la palabra alternativa { escondrijo}. Las reglas se podrían formular como sigue en español:

source: En resum, hi ha tres modalitats bàsiques d'interacció entre les persones i els programes de traducció automàtica: la preedició (preparació del text abans de la traducció automàtica), la postedició (correcció del text després de la traducció automàtica) i la interacció de la persona amb el sistema de traducció automàtica durant el procés de traducció.
es_es: En resumen, hay tres modalidades básicas de interacción entre las personas y los programas de traducción automática: la preedición (preparación del texto antes de la traducción automática), la postedición (corrección del texto después de la traducción automática) y la interacción de la persona con el sistema de traducción automática durante el proceso de traducción.

source: Utilitat de la traducció automàtica
es_es: Utilidad de la traducción automática

source: En els últims anys, especialment des que s'ha generalitzat l'accés públic a Internet, s'observa una tendència a incorporar sistemes de traducció automàtica com un dels components de sistemes més grans de comunicació. Aquesta aplicació de la TA per a l'assimilació es pot veure en xats bilingües, o en els sistemes que tradueixen les pàgines web segons anem visitant-les seguint enllaços; en aquests sistemes, la TA no s'invoca explícitament, sinó implícitament quan usem el servei.
es_es: En los últimos años, especialmente desde que se ha generalizado el acceso público en Internet, se observa una tendencia a incorporar sistemas de traducción automática como uno de los componentes de sistemas más grandes de comunicación. Esta aplicación de la TA para la asimilación se puede ver en chats bilingües, o en los sistemas que traducen las páginas web según vamos visitándolas siguiendo enlaces; en estos sistemas, la TA no se invoca explícitamente, sino implícitamente cuando usamos el servicio.

source: Indica quina d'aquestes situacions de traducció automàtica és d'assimilació d'informació: Narcís usa el programa traductor de l'anglés a l'espanyol Spanish Assistant per a llegir els documents electrònics que troba en Internet sobre la influència de l'èuscar sobre el gascó. Joan usa el Web Translator per a fer una versió en alemany de la seua pàgina Web abans de publicar-la en Internet. L'empresa Into the Wind tradueix automàticament el seu catàleg de milotxes i catxerulos a diverses llengües.
es_es: Indica cuál de estas situaciones de traducción automática es de asimilación de información: Narciso usa el programa traductor del inglés al español Spanish Assistant para leer los documentos electrónicos que encuentra en Internet sobre la influencia del euskera sobre el gascón. Joan usa el Web Translator para hacer una versión en alemán de su página Web antes de publicarla en Internet. La empresa Into the Wind traduce automáticamente su catálogo de dos tipos de cometas a varias lenguas.

source: Un llenguatge controlat és ``un subconjunt del llenguatge natural definit amb precisió, d'una banda restringit quant al lèxic, a la gramàtica i a l'estil, i d'una altra, possiblement estés amb terminologia i construccions gramaticals específiques d'un domini'' {huijsen98u}.
es_es: Un lenguaje controlado es ``un subconjunto del lenguaje natural definido con precisión, por un lado restringido en cuanto al léxico, a la gramática y al estilo, y de otra, posiblemente extendido con terminología y construcciones gramaticales específicas de un dominio'' {huijsen98uno}.

source: {MAHT:} L'usuari (un traductor competent o un professional independent) utilitza diccionaris bilingües, thesauri, conjugadors i declinadors, correctors ortogràfics, sintàctics i d'estil, i formularis o models de documents, com a ajuda mentre produeix una traducció de manera manual usant un processador de textos. Altres eines ---d'ús comú entre diversos traductors, i accessibles normalment com a recursos remots--- poden ser les bases de dades terminològiques i les bases de dades lèxiques multilingües (vegeu l'epígraf ), o les memòries de traducció (vegeu el capítol ).
es_es: {MAHT:} El usuario (un traductor competente o un profesional independiente) utiliza diccionarios bilingües, thesauri, conjugadores y declinatorios, correctores ortográficos, sintácticos y de estilo, y formularios o modelos de documentos, como ayuda mientras produce una traducción de manera manual usando un procesador de textos. Otras herramientas ---de uso común entre varios traductores, y accesibles normalmente como recursos remotos--- pueden ser las bases de datos terminológicas y las bases de datos léxicas multilingües (veáis el epígrafe ), o las memorias de traducción (veáis el capítulo ).

source: {} es refereix tant a la terminologia com a la sintaxi. {} només pot referir-se a la sintaxi. {} només pot referir-se a la terminologia. Quan s'usen per a la traducció, els llenguatges controlats restringeixen directament{} {} la llengua meta. {} la llengua origen. {} tant la llengua origen com la llengua meta.
es_es: {} se refiere tanto a la terminología como a la sintaxis. {} sólo puede referirse a la sintaxis. {} sólo puede referirse a la terminología. Cuando se usan para la traducción, los lenguajes controlados restringen directamente{} {} la lengua meta. {} la lengua origen. {} tanto la lengua origen como la lengua meta.

source: La postedició és convenient quan $$cost({ctraducció automàtica + postedició}) < cost(traducció humana). $$ Cal comprovar que la fórmula anterior es compleix, tot i que siga a llarg termini, abans de triar una estratègia de traducció per a disseminació basada en la postedició. Finalment, hem de tenir en compte que tot i que la persona posteditora coneix la llengua meta i converteix el text en brut a una forma genuïna en aquesta llengua, qui siga un veritable especialista en postedició, a més, també coneix el sistema de traducció automàtica i quins en són els errors més típics; així, la tasca de postedició és molt més eficient, ja que en conéixer l'origen i la causa dels errors se'n fa més fàcil i ràpida la correcció.
es_es: La postedición es conveniente cuando $$coste({ctraducción automática + postedición}) < coste(traducción humana). $$ Hay que comprobar que la fórmula anterior se cumple, a pesar de que sea a largo plazo, antes de elegir una estrategia de traducción para diseminación basada en la postedición. Finalmente, tenemos que tener en cuenta que a pesar de que la persona posteditora conoce la lengua meta y convierte el texto en bruto a una forma genuina en esta lengua, quién sea un verdadero especialista en postedición, además, también conoce el sistema de traducción automática y qué son los errores más típicos; así, la tarea de postedición es mucho más eficiente, puesto que al conocer el origen y la causa de los errores se hace más fácil y rápida la corrección.

source: Moltes de les aplicacions de la traducció automàtica es poden dividir en dos grans grups: l'assimilació d'informació (quan una persona usa la traducció automàtica per a obtenir informació a partir d'un document escrit en una altra llengua) i la disseminació ---també anomenada difusió--- d'informació (quan una persona usa la traducció automàtica per a produir documents que han de ser distribuïts a més d'un usuari). La traducció automàtica, tot i ser imperfecta, pot ser una eina molt útil en aquests dos grups d'aplicacions.
es_es: Muchas de las aplicaciones de la traducción automática se pueden dividir en dos grandes grupos: la asimilación de información (cuando una persona usa la traducción automática para obtener información a partir de un documento escrito en otra lengua) y la diseminación ---también llamada difusión--- de información (cuando una persona usa la traducción automática para producir documentos que tienen que ser distribuidos a más de un usuario). La traducción automática, a pesar de ser imperfecta, puede ser una herramienta muy útil en estos dos grupos de aplicaciones.

source: CAT, HAMT i MAHT
es_es: CAT, HAMT y MAHT

source: Facilitat de postedició de la traducció en brut. Intel·ligibilitat de la traducció en brut. Velocitat.
es_es: Facilidad de postedición de la traducción en bruto. Inteligibilidad de la traducción en bruto. Velocidad.

source: Llenguatges controlats
es_es: Lenguajes controlados

source: Volem posteditar un text traduït automàticament mirant tan poc com siga possible el text original. Ens ajuda conéixer quins són els mots homògrafs (vegeu la p. ) més comuns de la llengua origen?
es_es: Queremos posteditar un texto traducido automáticamente mirando tan poco como sea posible el texto original. ¿Nos ayuda conocer cuáles son las palabras homógrafas (veáis la p. ) más comunes de la lengua origen?

source: Una inventora monolingüe consulta documents web traduïts a la seua llengua per tal de descobrir si el seu nou invent ha estat patentat abans. Si la traducció es fa mitjançant un sistema automàtic, quin ús n'està fent?
es_es: Una inventora monolingüe consulta documentos web traducidos a su lengua para descubrir si su nuevo invento ha sido patentado antes. Si la traducción se hace mediante un sistema automático, ¿qué uso está haciendo?

source: Altres dos conceptes rellevants quan s'usen sistemes de traducció automàtica reals, és a dir, imperfectes, són els de preedició i { postedició}. En el primer cas, el text origen es prepara o adapta (preedita) per a millorar el comportament del sistema de traducció, eliminant, per exemple, l'ambigüitat del text, (vegeu l'apartat ), ja que pot voler dir exchange (reemplaçar) o put back (tornar a col·locar).} o també per a marcar parts del text que no han de ser traduïdes, com ara una citació, o que han de ser tractades de manera especial per no ser frases completes, com un títol. En el segon cas, el text meta produït pel sistema es refina o revisa ({ postedita}) perquè siga gramaticalment correcte o estiga escrit d'acord amb un registre determinat.
es_es: Otros dos conceptos relevantes cuando se usan sistemas de traducción automática reales, es decir, imperfectas, son los de preedición y postedición { }. En el primer caso, el texto origen se prepara o adapta (preedita) para mejorar el comportamiento del sistema de traducción, eliminando, por ejemplo, la ambigüedad del texto, (veáis el apartado ), puesto que puede querer decir exchange (reemplazar) o hede back (volver a colocar).} o también para marcar partes del texto que no tienen que ser traducidas, como por ejemplo una citación, o que tienen que ser tratadas de manera especial para no ser frases completas, como un título. En el segundo caso, el texto meta producido por el sistema se refina o revisa ({ postedita}) para que sea gramaticalmente correcto o esté escrito de acuerdo con un registro determinado.

source: Assimilació i disseminació
es_es: Asimilación y diseminación

source: Les categories lèxiques (o simplement { categories
es_es: Las categorías léxicas (o simplemente { categorías

source: Traducció automàtica assistida per la persona Traducció humana assistida per la màquina Usa un llenguatge controlat
es_es: Traducción automática asistida por la persona Traducción humana asistida por la máquina Usa un lenguaje controlado

source: És a dir, quan la revisió no és més costosa que refer tota la traducció a mà.
es_es: Es decir, cuando la revisión no es más costosa que rehacer toda la traducción a mano.

source: Vegeu l'apartat , on es discuteix un concepte molt relacionat, el de llenguatge controlat.
es_es: Veáse el apartado , donde se discute un concepto muy relacionado, el de lenguaje controlado.

source: Però, per posar-nos en l'altre extrem, ha de quedar clar que la traducció automàtica pot ser molt útil en aquelles situacions en què l'ús d'un traductor professional siga impracticable o impossible econòmicament. Algunes d'aquestes situacions són: La traducció automàtica de correu electrònic entre les persones d'un grup de treball internacional amb la finalitat d'agilitzar les comunicacions; la traducció immediata de documents durant la navegació per Internet (de fet, hi ha programes especialment dissenyats per a aquesta finalitat), o la traducció automàtica de converses electròniques interactives (teclat i pantalla, chat). La traducció i el manteniment de tots els manuals tècnics d'una família de productes (per exemple, els manuals de manteniment d'una gamma d'automòbils). En els epígrafs successius d'aquesta secció es donen alguns detalls sobre com es pot usar la traducció automàtica en situacions similars a les esmentades.
es_es: Pero, para ponernos en el otro extremo, tiene que quedar claro que la traducción automática puede ser muy útil en aquellas situaciones en que el uso de un traductor profesional sea impracticable o imposible económicamente. Algunas de estas situaciones son: La traducción automática de correo electrónico entre las personas de un grupo de trabajo internacional con el fin de agilizar las comunicaciones; la traducción inmediata de documentos durante la navegación por Internet (de hecho, hay programas especialmente diseñados para esta finalidad), o la traducción automática de conversaciones electrónicas interactivas (teclado y pantalla, chat). La traducción y el mantenimiento de todos los manuales técnicos de una familia de productos (por ejemplo, los manuales de mantenimiento de una gama de automóviles). En los epígrafes sucesivos de esta sección se dan algunos detalles sobre cómo se puede usar la traducción automática en situaciones similares a las mencionadas.

source: (*) Elegiu un idioma qualsevol que conegueu bé, $L$. És ben segur que $L$ té mots polisèmics que en una altra llengua $L'$ tenen més d'una traducció, segons el sentit que se'n prenga. Elegiu tres mots de $L$ que tinguen aquest problema i descrigueu com els tractaríeu en un llenguatge controlat basat en $L$. Les regles que formuleu per als autors que escriguen en el llenguatge controlat han de estar escrites en $L$ i no han de contenir referències a altres llengues.
es_es: () Elegís un idioma cualquiera que conozcáis bien, $L$. Es bastante seguro que $L$ tenga palabras polisémicas que en otra lengua $Lo $ tienen más de una traducción, según el sentido que se tome. Elegís tres palabras de $L$ que tengan este problema y describáis como los trataríais en un lenguaje controlado basado en $L$. Las reglas que formuláis para los autores que escriban en el lenguaje controlado tienen que estar escritas en $L$ y no tienen que contener referencias a otras lenguas.
